package baekjoon.solution1789

import java.io.*
/**
 * @desc
 서로 다른 N개의 자연수의 합이 S라고 한다. S를 알 때, 자연수 N의 최댓삾은 얼마일까?
 * @input
 *
 * @output
 *
 * @example
 *
 */

fun main() = with(BufferedReader(InputStreamReader(System.`in`))) {
    val S = readLine().toLong()

    var n = 1L
    while (n * (n + 1L) / 2L <= S) {
        n += 1L
    }
    println(n - 1L)
}
/*
1 199  1 ( 0 + 1)
1 2 197  3 ( 1+ 2)
1 2 3 194  6  (3 + 3)
1 2 3 4 190  10 ( 6 + 4)
1 2 3 4 5 185 (10 + 5)
1 2 3 4 5 6 180
1 2 3 4 5 6 7 173
1 2 3 4 5 6 7 8 165
1 2 3 4 5 6 7 8 9 156
1 2 3 4 5 6 7 8 9 10 146
1 2 3 4 5 6 7 8 9 10 11 135
1 2 3 4 5 6 7 8 9 10 11 12 123
1 2 3 4 5 6 7 8 9 10 11 12 13 110
1 2 3 4 5 6 7 8 9 10 11 12 13 14 96
1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 81
1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 65
1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 48
1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 30
1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 11
;;


 */
